/*
문제3. 다음 중 생성자에 대한 설명으로 정확히 옳지 않은 것은?(모두 고르시오)
                                                  2 ,5 
1. 모든 생성자의 이름은 클래스의 이름과 동일해야한다
2. 생성자를 객체를 생성하기 위한 것이다.
   풀이 ->생성자가 객체를 생성할때 사용되기는 하지만, 
   	     정확히 객체의 인스턴스변수값을 빠르게 초기화할 목적으로 사용되는것이다.
      
3. 클래스에는 생성자가 반드시 하나 이상 있어야 한다.
4. 생성자가 없는 클래스는 컴파일러가 기본생성자를 하나 만들어 추가한다.
5. 생성자는 오버로딩 할 수 없다.
	풀이 -> 생성자도 오버로딩이 가능해서 하나의 클래스에 여러개의 생성자를 선언할수 있다.
*/
package test;

public class ConstructorEx {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
