
/*
	static 키워드에 대해서
	
	1. static 키워드에 대해 아는대로 적으시오.
		: static 키워드를 사용하면 JVM의 Method영역에 올라가면서 class파일 내부에 개별적으로 할당된다.
		객체메모리를 생성하지않고도 클래스명.클래스변수명을 작성해서 접근하거나 값을 변경할 수 있으며,
		** 생성된 여러 객체메모리들의 공용으로 사용할 데이터를 저장하는데 이용되는 키워드이다. **
		static 키워드를 변수에 붙이면 클래스변수, 메소드에 붙이면 클래스메소드가 된다.
		
		
	2. static 키워드를 쓰는 이유?
		:생성된 여러 객체메모리들의 공용으로 사용할 데이터를 저장하는데 이용되는 키워드이다.
	
	3. 모든 변수와 메소드에 static을 붙이나요? 
		: 
	
	4. 어떤 경우 static을 붙이나요? 어떤 경우에 static을 붙일 수 없습니까?
	   구체적으로 적으시오.
	   
	5. 만일 당신이 새로운 클래스를 작성한다고 할 때, 어떤 경우 static키워드를 사용해야한다고 생각하는지 적으시오.
	
	
*/


public class Static_test {

	public static void main(String[] args) {
		

	}

}
